<html>
<body>

<p>
Le point d'entr&eacute;e du code se trouve &agrave; SimplePaint.main().
Donc, pour ceux qui travaillent sur une invite de commande, faites
<pre>
   javac *.java
</pre>
pour compiler, ensuite
<pre>
   java SimplePaint
</pre>
pour ex&eacute;cuter le logiciel.





<p>
Instructions de fonctionnement:
<blockquote>

<p>
Pour dessiner une forme g&eacute;ometrique, s&eacute;lectionnez un des boutons
dans la barre d'outils &agrave; gauche ("Square", "Rectangle", etc.), ensuite
mettez le curseur sur la toile &agrave; droite, appuyez et tenez le bouton
de souris de gauche, glissez la souris, et l&acirc;chez le bouton de souris.
Certaines formes n&eacute;cessitent ensuite de repositionner le
curseur et d'appuyer et l&acirc;cher le bouton de souris une deuxi&egrave;me fois.
R&eacute;p&eacute;tez pour cr&eacute;er d'autres formes.

<p>
Pour changer la couleur utilis&eacute;e lorsqu'une forme est cr&eacute;&eacute;e,
cliquez sur la couleur d&eacute;sir&eacute;e dans la palette de couleurs.

<p>
Pour changer la position d'une forme, s&eacute;lectionnez le bouton
"Select and Move" parmi les outils, ensuite mettez le curseur
sur la forme &agrave; d&eacute;placer, appuyez et tenez le bouton de souris de
gauche, glissez la souris, et l&acirc;chez le bouton de souris.

<p>
Pour d&eacute;filer la toile, appuyer et glisser avec le bouton de droit
sur la toile.

<p>
Pour d&eacute;placer la palette de couleurs, appuyer et glisser avec
le bouton de gauche sur la poign&eacute;e sur la bordure sup&eacute;rieure
de la palette.

<p>
Pour afficher un m&eacute;nu radial des outils, appuyer et tenir
la touche de modification Ctrl, ensuite appuyer et tenir
le bouton de souris gauche, sur la toile.  Glisser dans la
direction de l'outil d&eacute;sir&eacute;, et l&acirc;chez pour compl&eacute;ter la
s&eacute;lection.

<p>
Pour afficher le "Control Menu" offrant d'autres options,
appuyer et tenir la touche de modification Shift, ensuite appuyer et tenir
le bouton de souris gauche.
Si vous faites cela sur la toile, vous aurez deux options;
si vous le faites sur une forme, vous aurez plus d'options.

<p>
Les commandes de menus:

<blockquote>
<p>
   File/Clear: efface toutes les formes sur la toile

<p>
   File/Quit: pour quitter

<p>
   View/Show Tools: montre ou cache la barre d'outils &agrave; gauche

<p>
   View/Show Colors: montre ou cache la palette de couleurs

<p>
   View/Enable Compositing: active ou d&eacute;sactive le rendu des
      formes avec transparence.  Tout d&eacute;pendant de votre
      plateforme, l'utilisation de la transparence pourrait
      grandement ralentir le logiciel.

<p>
   Help/About: &agrave; propos

</blockquote>
</blockquote>

</body>
</html>


